The  ExtensibleStorageFilter  type exposes the following members.
 Properties
Name  |   Description
Inverted
 True if the results of the filter are inverted; elements that would normally be accepted by this filter will be rejected, and elements that would normally be rejected will be accepted.
 (Inherited from  ElementFilter  .)
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from  ElementFilter  .)
SchemaGuid
 Schema id used to filter elements with extensible storage data
 See Also
  ExtensibleStorageFilter Class
  Autodesk.Revit.DB.ExtensibleStorage Namespace